app/controllers/api/answers_controller.rb

  def create
    @answer = Answer.create(answer_params)
    @answer.answerer_id = current_user.id
    @answer.question_id = params[:id]

    if @answer.save
---
INSERT INTO "answers" ("body", "question_id", "answerer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "<p>t1 ansswer</p>"], ["question_id", 5], ["answerer_id", 37], ["created_at", "2020-08-10 14:32:46.335221"], ["updated_at", "2020-08-10 14:32:46.335221"]]