app/controllers/api/questions_controller.rb

    def create
        @question = Question.new(question_params)
        @question.asker_id = current_user.id

        if @question.save
---
INSERT INTO "questions" ("asker_id", "views", "title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["asker_id", 37], ["views", 0], ["title", "t4"], ["body", "b4"], ["created_at", "2020-06-22 05:15:53.168502"], ["updated_at", "2020-06-22 05:15:53.168502"]]

    def update
        @question = Question.find(params[:id])

        if @question.update(question_params)
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "questions" SET "body" = $1, "updated_at" = $2 WHERE "questions"."id" = $3  [["body", "b1-edited"], ["updated_at", "2020-12-15 02:40:25.922974"], ["id", 5]]