app/controllers/api/votes_controller.rb

  def index
    @question = Question.find(params[:questionId])
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def create
    @new_vote = Vote.new(vote_params)
    @new_vote.voter_id = current_user.id

    old_vote = Vote.find_by(voter_id: current_user.id, votable_type: params[:votable_type], votable_id: params[:votable_id]);

    if old_vote.nil?
      @new_vote.save!
---
SELECT  "votes".* FROM "votes" WHERE "votes"."voter_id" = $1 AND "votes"."votable_type" = $2 AND "votes"."votable_id" = $3 LIMIT $4  [["voter_id", 37], ["votable_type", "Question"], ["votable_id", 7], ["LIMIT", 1]]
INSERT INTO "votes" ("votable_id", "votable_type", "created_at", "updated_at", "voter_id", "score") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["votable_id", 7], ["votable_type", "Question"], ["created_at", "2021-01-26 15:15:54.193167"], ["updated_at", "2021-01-26 15:15:54.193167"], ["voter_id", 37], ["score", -1]]