app/models/user.rb

  def generate_session_token
    self.session_token = SecureRandom.urlsafe_base64
    while User.find_by(session_token: self.session_token)
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "pk3t9J6e2QwJSeY3NsU5qQ"], ["LIMIT", 1]]